const json_draw = {
    "signs": [{
        "number": "一",
        "content": {
            "签诗": "日出便见风云散，光明清净照世间，一向前途通大道，万事清吉保平安。",
            "签诗典故": "包公请雷惊仁宗"
        }
    },
    {
        "number": "二",
        "content": {
            "签诗": "于今此景正当时，看看欲吐百花魁，若能遇得春色到，一洒清吉脱尘埃。",
            "签诗典故": "赵子龙救阿斗 陈东初祭梅"
        }
    },
    {
        "number": "三",
        "content": {
            "签诗": "劝君把定心莫虚，天注衣禄自有余，和合重重常吉庆，时来终遇得明珠。",
            "签诗典故": " "
        }
    },
    {
        "number": "四",
        "content": {
            "签诗": "风恬浪静可行舟，恰是中秋月一轮，凡事不须多忧虑，福禄自有庆家门。",
            "签诗典故": "卢龙王次子招亲"
        }
    },
    {
        "number": "五",
        "content": {
            "签诗": "只恐前途命有变，劝君作急可宜先，且守长江无大事，命逢太白守身边。",
            "签诗典故": "王剪战袁达"
        }
    },
    {
        "number": "六",
        "content": {
            "签诗": "风云致雨落洋洋，天灾时气必有伤，命内此事难和合，更逢一足出外乡。",
            "签诗典故": "鸟精乱宋朝 刘智远战瓜精"
        }
    },
    {
        "number": "七",
        "content": {
            "签诗": "云开月出正分明，不须进退问前程，婚姻皆由天注定，和合清吉万事成。",
            "签诗典故": "国公暗察白袍将 尉迟恭挂帅"
        }
    },
    {
        "number": "八",
        "content": {
            "签诗": "禾稻看看结成完，此事必定两相全，回到家中宽心坐，妻儿鼓舞乐团圆。",
            "签诗典故": "薛仁贵回家"
        }
    },
    {
        "number": "九",
        "content": {
            "签诗": "龙虎相随在深山，君尔何须背后看，不知此去相爱误，他日与我却无干。",
            "签诗典故": " "
        }
    },
    {
        "number": "十",
        "content": {
            "签诗": "花开结子一半枯，可惜今年汝虚度，渐渐日落西山去，劝君不用向前途。",
            "签诗典故": "岳飞掠秦桧"
        }
    },
    {
        "number": "十一",
        "content": {
            "签诗": "灵鸡渐渐见分明，凡事且看子丑寅，云开月出照天下，郎君即便见太平。",
            "签诗典故": "韩文公过秦岭湘子扫霜雪"
        }
    },
    {
        "number": "十二",
        "content": {
            "签诗": "长江风浪渐渐静，于今得进可安宁，必有贵人相扶助，凶事脱出见太平。",
            "签诗典故": "智远战瓜精"
        }
    },
    {
        "number": "十三",
        "content": {
            "签诗": "命中正逢罗孛关，用尽心机总未休，作福问神难得过，恰是行舟上高滩。",
            "签诗典故": "汉李广父子阵亡 三藏被红孩儿烧"
        }
    },
    {
        "number": "十四",
        "content": {
            "签诗": "财中渐渐见分明，花开花谢结子成，宽心且看月中桂，郎君即便见太平。",
            "签诗典故": "桃园三结义"
        }
    },
    {
        "number": "十五",
        "content": {
            "签诗": "八十原来是太公，看看晚景遇文王，目下紧事休相问，劝君且守待运通。",
            "签诗典故": "渭水河太公钓鱼 渭水钓鱼武吉挑柴打死人"
        }
    },
    {
        "number": "十六",
        "content": {
            "签诗": "不须作福不须求，用尽心机总未休，阳世不知阴世事，官法如炉不自由。",
            "签诗典故": "李世民游地府"
        }
    },
    {
        "number": "十七",
        "content": {
            "签诗": "旧恨重重未改进，危危祸患不临身，户内用心再作福，龙蛇交会得和平。",
            "签诗典故": "庄子破棺"
        }
    },
    {
        "number": "十八",
        "content": {
            "签诗": "君问中间此言因，看看禄马拱前程，求得贵人多得利，和合自有两分明。",
            "签诗典故": "秦叔宝救李渊"
        }
    },
    {
        "number": "十九",
        "content": {
            "签诗": "富贵由命天注定，心高必然误君期，不然且回依旧路，云开月出自分明。",
            "签诗典故": "红孩儿截住去路"
        }
    },
    {
        "number": "二十",
        "content": {
            "签诗": "前途功名未得意，只恐命内有交加，两家必定防损失，劝君且退莫咨嗟。",
            "签诗典故": "孙悟空大难火灾"
        }
    },
    {
        "number": "二十一",
        "content": {
            "签诗": "十方佛法有灵通，大难祸患不相同，红日当空常照耀，还有贵人到家堂。",
            "签诗典故": "朱寿昌辞官寻母 观音收大鹏鸟"
        }
    },
    {
        "number": "二十二",
        "content": {
            "签诗": "太公八十家业成，月出光辉四海明，命内自然逢大吉，茅屋中间百事亨。",
            "签诗典故": "周文王为太公拖车"
        }
    },
    {
        "number": "二十三",
        "content": {
            "签诗": "欲去长江水阔茫，前途未遂运未通，如今丝纶常在手，只恐鱼水不相逢。",
            "签诗典故": "姜子牙火烧琵琶"
        }
    },
    {
        "number": "二十四",
        "content": {
            "签诗": "月出光辉四海明，前途禄位见太平，浮云扫退终无事，可保祸患不临身。",
            "签诗典故": "秦叔宝救李渊"
        }
    },
    {
        "number": "二十五",
        "content": {
            "签诗": "总是前途莫心劳，求神问圣枉是多，但看鸡犬日过后，不须作福事如何。",
            "签诗典故": "凤娇观音寺问签中奸人计"
        }
    },
    {
        "number": "二十六",
        "content": {
            "签诗": "选出牡丹第一枝，劝君折取莫迟疑，世间若问相知处，万事逢春正及时。",
            "签诗典故": "范丹洗浴遇贤妻"
        }
    },
    {
        "number": "二十七",
        "content": {
            "签诗": "君尔宽心且自由，门庭清吉家无忧，财宝自然终吉利，凡事无伤不用求。",
            "签诗典故": "胡完救文氏母女"
        }
    },
    {
        "number": "二十八",
        "content": {
            "签诗": "于今莫作此当时，虎落平阳被犬欺，世间凡事何难定，千山万水也迟疑。",
            "签诗典故": "楚汉相争"
        }
    },
    {
        "number": "二十九",
        "content": {
            "签诗": "枯木可惜未逢春，如今还在暗中藏，宽心且守风霜退，还君依旧作乾坤。",
            "签诗典故": "周元表充军获救"
        }
    },
    {
        "number": "三十",
        "content": {
            "签诗": "渐渐看此月中和，过后须防未得高，改变颜色前途去，凡事必定见重劳。",
            "签诗典故": "猪哥过柿山"
        }
    },
    {
        "number": "三十一",
        "content": {
            "签诗": "绿柳苍苍正当时，任君此去作乾坤，花果结实无残谢，福禄自有庆家门。",
            "签诗典故": "董永皇都市仙女送孩儿"
        }
    },
    {
        "number": "三十二",
        "content": {
            "签诗": "龙虎相交在门前，此事必定两相连，黄金忽然变成铁，何用作福问神仙。",
            "签诗典故": "刘备入东吴进赘"
        }
    },
    {
        "number": "三十三",
        "content": {
            "签诗": "欲去长江水阔茫，行舟把定未遭风，户内用心再作福，看看鱼水得相逢。",
            "签诗典故": "铜银买纸靴 刘备入东吴回荆州"
        }
    },
    {
        "number": "三十四",
        "content": {
            "签诗": "危险高山行过尽，莫嫌此路有重重，若见兰桂渐渐发，长蛇反转变成龙。",
            "签诗典故": "曹操潼关遇马超"
        }
    },
    {
        "number": "三十五",
        "content": {
            "签诗": "此事何须用心机，前途变怪自然知，看看此去得和合，渐渐脱出见太平。",
            "签诗典故": "吴汉杀妻为母救主"
        }
    },
    {
        "number": "三十六",
        "content": {
            "签诗": "福如东海寿如山，君尔何须叹苦难，命内自然逢大吉，祈保分明得自安。",
            "签诗典故": "薛仁贵救驾"
        }
    },
    {
        "number": "三十七",
        "content": {
            "签诗": "运逢得意身显变，君尔身中皆有益，一向前途无难事，决意之中保清吉。",
            "签诗典故": "正德君戏李凤姐"
        }
    },
    {
        "number": "三十八",
        "content": {
            "签诗": "名显有意在中央，不须祈祷心自安，看看早晚日过后，即时得意在其间。",
            "签诗典故": "三请卧龙先生"
        }
    },
    {
        "number": "三十九",
        "content": {
            "签诗": "意中若问神仙路，劝尔且退望高楼，宽心且守宽心坐，必然遇得贵人扶。",
            "签诗典故": "杨文广被困柳州城 孔夫子小儿答"
        }
    },
    {
        "number": "四十",
        "content": {
            "签诗": "平生富贵成禄位，君家门户定光辉，此中必定无损失，夫妻百岁喜相随。",
            "签诗典故": "薛平贵探寒窑"
        }
    },
    {
        "number": "四十一",
        "content": {
            "签诗": "今行到此实难推，歌歌畅饮自徘徊，鸡犬相闻消息近，婚姻夙世结成双。",
            "签诗典故": "刘全进瓜"
        }
    },
    {
        "number": "四十二",
        "content": {
            "签诗": "一重江水一重山，谁知此去路又难，任他改求终不过，是非终久未得安。",
            "签诗典故": "姜女送寒衣哭倒万里长城"
        }
    },
    {
        "number": "四十三",
        "content": {
            "签诗": "一年作事急如飞，君尔宽心莫迟疑，贵人还在千里外，音信月中渐渐知。",
            "签诗典故": "苏秦假不第"
        }
    },
    {
        "number": "四十四",
        "content": {
            "签诗": "客到前途多得利，君尔何故两相疑，虽是中间防进退，月出光辉得运时。",
            "签诗典故": "益春留伞"
        }
    },
    {
        "number": "四十五",
        "content": {
            "签诗": "花开今已结成果，富贵荣华终到老，君子小人相会合，万事清吉莫烦恼。",
            "签诗典故": "孔夫子过番逢小儿 薛仁贵固白虎关父子不相逢"
        }
    },
    {
        "number": "四十六",
        "content": {
            "签诗": "功名得意与君显，前途富贵喜安然，若遇一轮明月照，十五团圆光满天。",
            "签诗典故": "狄仁杰中兴大唐"
        }
    },
    {
        "number": "四十七",
        "content": {
            "签诗": "君尔何须问圣迹，自己心中皆有益，于今且看月中旬，凶事脱出化成吉。",
            "签诗典故": "刘永作官荫妻儿 李三娘井边会"
        }
    },
    {
        "number": "四十八",
        "content": {
            "签诗": "阳世作事未和同，云遮月色正朦胧，心中意欲前途去，只恐前途运未通。",
            "签诗典故": "王昭君和番"
        }
    },
    {
        "number": "四十九",
        "content": {
            "签诗": "言语虽多不可从，风云静处未行龙，暗中终得明消息，君尔何须问重重。",
            "签诗典故": "伍子胥过昭关"
        }
    },
    {
        "number": "五十",
        "content": {
            "签诗": "佛前发誓无异心，且看前途得好音，此物原来本是铁，也能变化得成金。",
            "签诗典故": "小儿路遇恶鬼"
        }
    },
    {
        "number": "五十一",
        "content": {
            "签诗": "东西南北不堪行，前途此事正可当，劝君把定莫烦恼，家门自有保安康。",
            "签诗典故": "赵匡胤困河东"
        }
    },
    {
        "number": "五十二",
        "content": {
            "签诗": "功名事业本由天，不须挂念意悬悬，若问中间迟与速，风云际会在眼前。",
            "签诗典故": "郑元和嫖阿仙"
        }
    },
    {
        "number": "五十三",
        "content": {
            "签诗": "看君来问心中事，积善之家庆有余，运亨财子双双至，指日喜气溢门闾。",
            "签诗典故": "苏秦不第，苏秦夫妻相会"
        }
    },
    {
        "number": "五十四",
        "content": {
            "签诗": "孤灯寂寂夜沉沉，万事清吉万事成，若逢阴中有善果，烧得好香达神明。",
            "签诗典故": "念月英相国寺 小姐求佛嫁良缘"
        }
    },
    {
        "number": "五十五",
        "content": {
            "签诗": "须知进退总言虚，看看发暗未必全，珠玉深藏还未变，心中但得枉徒然。",
            "签诗典故": "郭华醉酒误佳期 玉堂春求佛嫁良缘"
        }
    },
    {
        "number": "五十六",
        "content": {
            "签诗": "病中若得苦心劳，到底完全总未遭，去后不须回头问，心中事务尽消磨。",
            "签诗典故": "范少伯泛舟五湖"
        }
    },
    {
        "number": "五十七",
        "content": {
            "签诗": "劝君把定心莫虚，前途清吉得运时，到底中间无大事，又遇神仙守安居。",
            "签诗典故": "白蛇精遇许汉文 庞涓孙膑学法"
        }
    },
    {
        "number": "五十八",
        "content": {
            "签诗": "蛇身意欲变成龙，只恐命内运未通，久病且作宽心座，言语虽多不可从。",
            "签诗典故": "汉高祖斩白蛇"
        }
    },
    {
        "number": "五十九",
        "content": {
            "签诗": "有心作福莫迟疑，求名清吉正当时，此事必能成会合，财宝自然喜相随。",
            "签诗典故": "皇都市上有神仙 老鼠精闹宋朝"
        }
    },
    {
        "number": "六十",
        "content": {
            "签诗": "月出光辉本清吉，浮云总是蔽荫色，户内用心再作福，当官分理便有益。",
            "签诗典故": "薛刚踢死太子惊崩圣驾"
        }
    }
    ]
}
module.exports = json_draw;